Revit 2027 API
OrdinateTextPosition Enumeration
 The ordinate dimension text position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OrdinateTextPosition
Public Enumeration OrdinateTextPosition
public enum class OrdinateTextPosition
type OrdinateTextPosition
Members
Member name | Value | Description
EndOfWitnessLine | 0 |  The dimension text position will be at the end of witness line.
NextToWitnessLine | 1 |  The dimension text position will be next to witness line.
See Also
Reference
Autodesk.Revit.DB Namespace